package com.hillel.lesson_10.charCount;

public class Text {

    private static final String TEXT = "В одном селе, возле Блудова болота, в районе города Переславль-Залесского, осиротели двое детей. Их мать умерла от болезни, отец погиб на Отечественной войне." +
            "Мы жили в этом селе всего только через один дом от детей. И, конечно, мы тоже вместе с другими соседями старались помочь им, чем только могли. Они были очень милые. Настя была как золотая курочка на высоких ногах. Волосы у нее, ни темные, ни светлые, отливали золотом, веснушки по всему лицу были крупные, как золотые монетки, и частые, и тесно им было, и лезли они во все стороны. Только носик один был чистенький и глядел вверх попугайчиком" +
            "Митраша был моложе сестры на два года. Ему было всего только десять лет с хвостиком. Он был коротенький, но очень плотный, лобастый, затылок широкий. Это был мальчик упрямый и сильный." +
            "«Мужичок в мешочке», улыбаясь, называли его между собой учителя в школе." +
            "Мужичок в мешочке, как и Настя, был весь в золотых веснушках, а носик его чистенький тоже, как у сестры, глядел вверх попугайчиком." +
            "После родителей все их крестьянское хозяйство досталось детям: изба пятистенная, корова Зорька, телушка Дочка, коза Дереза, безыменные овцы, куры, золотой петух Петя и поросенок Хрен." +
            "Вместе с этим богатством досталась, однако, детишкам бедным и большая забота о всех этих живых существах. Но с такой ли бедой справлялись наши дети в тяжкие годы Отечественной войны! Вначале, как мы уже говорили, детям приходили помогать их дальние родственники и все мы, соседи. Но очень что-то скоро умненькие и дружные ребята сами всему научились и стали жить хорошо." +
            "И какие это были умные детишки! Если только возможно было, они присоединялись к общественной работе. Их носики можно было видеть на колхозных полях, на лугах, на скотном дворе, на собраниях, в противотанковых рвах: носики такие задорные." +
            "В этом селе мы, хотя и приезжие люди, знали хорошо жизнь каждого дома. И теперь можем сказать: не было ни одного дома, где бы жили и работали так дружно, как жили наши любимцы." +
            "Точно так же, как и покойная мать, Настя вставала далеко до солнца, в предрассветный час, по трубе пастуха. С хворостиной в руке выгоняла она свое любимое стадо и катилась обратно в избу. Не ложась уже больше спать, она растопляла печь, чистила картошку, заправляла обед и так хлопотала по хозяйству до ночи." +
            "Митраша выучился у отца делать деревянную посуду: бочонки, шайки, лоханки. У него есть фуганок, ладило 1 длиной больше чем в два его роста. И этим ладилом он подгоняет дощечки одну к одной, складывает и обдерживает железными или деревянными обручами." +
            "При корове двум детям не было такой уж нужды, чтобы продавать на рынке деревянную посуду, но добрые люди просят, кому — шайку на умывальник, кому нужен под капели бочонок, кому — кадушечку солить огурцы или грибы, или даже простую посудинку с зубчиками — домашний цветок посадить." +
            "Сделает, и потом ему тоже отплатят добром. Но, кроме бондарства, на нем лежит и все мужское хозяйство, и общественное дело. Он бывает на всех собраниях, старается понять общественные заботы и, наверно, что-то смекает." +
            "Очень хорошо, что Настя постарше брата на два года, а то бы он непременно зазнался, и в дружбе у них не было бы, как теперь, прекрасного равенства. Бывает, и теперь Митраша вспомнит, как отец наставлял его мать, и вздумает, подражая отцу, тоже учить свою сестру Настю. Но сестренка мало слушается, стоит и улыбается... Тогда Мужичок в мешочке начинает злиться и хорохориться и всегда говорит, задрав нос:";

    public static String getText(){
        return TEXT;
}

}
